Revit 2026 API
StructuralConnectionHandler.Create Method
Overload List
Name | Description
Create(Document, IList<ElementId>, ElementId)
Create(Document, IList<ElementId>, String)
Create(Document, IList<ElementId>, ElementId, IList<ConnectionInputPoint>)
Top
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace